Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData.DimensionFlow
The dimension flow which is used to calculate flow of the pipe. Units: (gal/min).
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData.FlowConversionMode
The flow conversion mode of the pipe.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData.FixtureUnits
The fixture units of the pipe.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData.FlowConfiguration
The flow configuration mode of the pipe.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData.Flow
The actual flow of the plumbing fixture converted from dimension flow or fixture unit. Units: (gal/min).
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData
The input and output data used by external servers for calculation of the pipe plumbing fixture flow.
Remarks:
FlowConfiguration, FixtureUnits, FlowConversionMode, and DimensionFlow are input field values for the calculation. Flow is output field value for the calculation.
Since:
2014